Cases/sCO2Channel-DES_komega2/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat raw;
surfaceFormat raw;
interpolationScheme cell;
// Fields to sample.
fields (alpha1);
surfaces
(
    CrossSection
    {
        type            patch;
        patches         (BackWall);
        // Optional: whether to leave as faces (=default) or triangulate
        // triangulate     false;
    }
);


// *********************************************************************** //


